function [para_output] = mini_snap_plan(point_input, T, vel_input, proportion_input)

%以分三段为例：
%X_1(t) = a_1*t^5 + b_1*t^4 + c_1*t^3 + d_1*t^2 + e_1*t + f_1
%X_2(t) = a_2*t^5 + b_2*t^4 + c_2*t^3 + d_2*t^2 + e_2*t + f_2
%X_3(t) = a_3*t^5 + b_3*t^4 + c_3*t^3 + d_3*t^2 + e_3*t + f_3

%四阶导数可表示为：
%four derivative:120*a*t + 24*b

%本次规划共有多少段
seg_time = length(proportion_input);

%本次规划共有多少给定点
point_num = length(point_input);

%本次规划共有多少给定速度
vel_num = length(vel_input);

%在每个给定点处的时间
t(1) = proportion_input(1) * T; 
if seg_time > 1
    for i = 2:1:seg_time
        t(i) = t(i-1) + proportion_input(i) * T
    end
end

%目标函数
H = zeros(6 * seg_time , 6 * seg_time);
for i = 1:1:seg_time
    if i == 1
        H(1:2,1:2) = [4800 * t(1)^3 , 1440 * t(1)^2;           
                      1440 * t(1)^2 , 576 *t(1);];
    else
        H((i - 1) * 6 + 1:(i - 1) * 6 + 2 , (i - 1) * 6 + 1:(i - 1) * 6 + 2) = [4800 * (t(i)^3 - t(i - 1)^3) , 1440 * (t(i)^2 - t(i - 1)^2);           
                                                                                1440 * (t(i)^2 - t(i - 1)^2) , 576 * (t(i)^1 - t(i - 1)^1);];
    end
end

f=[];

%等式约束
Aeq = zeros(5 * seg_time , 6 * seg_time);
Aeq(1,6) = 1;
%给定点处的位置约束
for i = 1:1:seg_time
    Aeq(i + 1 , (i - 1) * 6 + 1:i * 6) = [t(i)^5 , t(i)^4 , t(i)^3 , t(i)^2 , t(i)^1 , t(i)^0;];
end
%给定点处的位置-速度-加速度衔接约束
for i = 1:1:seg_time - 1
    Aeq((i - 1) * 3 + 1 + seg_time + 1 , (i - 1) * 6 + 1:(i - 1) * 6 + 12) = [t(i)^5 ,      t(i)^4 ,      t(i)^3 ,     t(i)^2 ,     t(i)^1 ,     t(i)^0 , -t(i)^5 ,      -t(i)^4 ,      -t(i)^3 ,     -t(i)^2 ,     -t(i)^1 ,     -t(i)^0;];
    Aeq((i - 1) * 3 + 1 + seg_time + 2 , (i - 1) * 6 + 1:(i - 1) * 6 + 12) = [5 * t(i)^4 ,  4 * t(i)^3 ,  3 * t(i)^2 , 2 * t(i)^1 , 1 * t(i)^0 , 0 ,      -5 * t(i)^4 ,  -4 * t(i)^3 ,  -3 * t(i)^2 , -2 * t(i)^1 , -1 * t(i)^0 , 0;];
    Aeq((i - 1) * 3 + 1 + seg_time + 3 , (i - 1) * 6 + 1:(i - 1) * 6 + 12) = [20 * t(i)^3 , 12 * t(i)^2 , 6*t(i)^1 ,   2*t(i)^0 ,   0 ,          0 ,      -20 * t(i)^3 , -12 * t(i)^2 , -6*t(i)^1 ,   -2*t(i)^0 ,   0 ,           0;];
end
%1 + seg_time + 3 * (seg_time - 1) = 4 * seg_time - 2 行

%给定点处的速度约束
Aeq(4 * seg_time - 2 + 1 , 1:6) = [0 , 0 , 0 , 0 , 1 , 0;];
for i = 1:1:seg_time
    Aeq(4 * seg_time - 2 + 1 + i , (i - 1) * 6 + 1:i * 6) = [5 * t(i)^4 , 4 * t(i)^3 , 3 * t(i)^2 , 2 * t(i)^1 , 1 * t(i)^0 , 0;];
end
%4 * seg_time - 2 + 1 + seg_time = 5 * seg_time - 1 行

%末位置处的加速度约束
Aeq(5 * seg_time , (seg_time - 1) * 6 + 1:seg_time * 6) = [20 * t(seg_time)^3 , 12 * t(seg_time)^2 , 6 * t(seg_time)^1 , 2 * t(seg_time)^0 , 0 , 0;];

beq = zeros(1 , 5 * seg_time);
for i = 1:1:point_num
    beq(i) = point_input(i);
end
for i = 1:1:seg_time - 1
    beq(point_num + (i - 1) * 3 + 1) = 0;
    beq(point_num + (i - 1) * 3 + 2) = 0;
    beq(point_num + (i - 1) * 3 + 3) = 0;
end
for i = 1:1:vel_num
    beq(4*seg_time - 2 + i) = vel_input(i);
end
beq(5*seg_time) = 0;

%不等式约束
A = [];
b=[];

[x] = quadprog(H,f,A,b,Aeq,beq);
para_output = x;



% t1 = proportion_input(1) * T;                            %第一段轨迹结束的时间点
% t2 = (proportion_input(1) + proportion_input(2)) * T;    %第二段轨迹结束的时间点
% t3 = T;                                                  %第三段轨迹结束的时间点
% 
% %目标函数
% H=[4800*(t1)^3 , 1440*(t1)^2 ,  0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;           
%    1440*(t1)^2 , 576*t1 ,       0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;           
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;           
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;           
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,   4800*(t2^3-t1^3), 1440*(t2^2-t1^2),  0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;            
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,   1440*(t2^2-t1^2),  576*(t2-t1),      0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;           
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;          
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;          
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;           
%    0 ,           0 ,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;
%    0,            0 ,            0 ,            0 ,            0 ,            0 ,           0,            0 ,            0 ,            0 ,           0 ,            0 ,   4800*(t3^3-t2^3), 1440*(t3^2-t2^2),  0 ,            0 ,           0 ,            0;
%    0,            0 ,            0 ,            0 ,            0 ,            0 ,           0,            0 ,            0 ,            0 ,           0 ,            0 ,   1440*(t3^2-t2^2),  576*(t3-t2),      0 ,            0 ,           0 ,            0;
%    0,            0 ,            0 ,            0 ,            0 ,            0 ,           0,            0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;
%    0,            0 ,            0 ,            0 ,            0 ,            0 ,           0,            0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;
%    0,            0 ,            0 ,            0 ,            0 ,            0 ,           0,            0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;
%    0,            0 ,            0 ,            0 ,            0 ,            0 ,           0,            0 ,            0 ,            0 ,           0 ,            0 ,           0 ,           0 ,            0 ,            0 ,           0 ,            0;];
% 
% f=[];
% 
% %等式约束
% Aeq=[0 ,           0 ,            0 ,            0 ,            0 ,           1 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0 ,          0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = 0时的位置           
%      0 ,           0 ,            0 ,            0 ,            0 ,           0 ,           t1^5 ,        t1^4 ,         t1^3 ,         t1^2 ,         t1^1 ,        t1^0 ,       0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = T/3时的位置    
%      0,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0 ,          t2^5 ,        t2^4 ,         t2^3 ,         t2^2 ,         t2^1 ,        t2^0;        %t = 2T/3时的位置
%      0,            0 ,            0 ,            0 ,            0 ,           0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0 ,          t3^5 ,        t3^4 ,         t3^3 ,         t3^2 ,         t3^1 ,        t3^0;        %t = T时的位置
%      t1^5 ,        t1^4 ,         t1^3 ,         t1^2 ,         t1^1 ,        t1^0 ,        -t1^5 ,       -t1^4 ,        -t1^3 ,        -t1^2 ,        -t1^1 ,       -t1^0 ,      0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = T/3时的位置衔接
%      5*t1^4 ,      4*t1^3 ,       3*t1^2 ,       2*t1^1 ,       1*t1^0 ,      0 ,           -5*t1^4 ,     -4*t1^3 ,      -3*t1^2 ,      -2*t1^1 ,      -1*t1^0 ,     0 ,          0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = T/3时的速度衔接
%      20*t1^3 ,     12*t1^2 ,      6*t1^1 ,       2*t1^0 ,       0 ,           0 ,           -20*t1^3 ,    -12*t1^2 ,     -6*t1^1 ,      -2*t1^0 ,      0 ,           0 ,          0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = T/3时的加速度衔接
%      0             0 ,            0 ,            0 ,            0 ,           0 ,           t2^5 ,        t2^4 ,         t2^3 ,         t2^2 ,         t2^1 ,        t2^0 ,       -t2^5 ,       -t2^4 ,        -t2^3 ,        -t2^2 ,        -t2^1 ,       -t2^0 ;      %t = 2T/3时的位置衔接
%      0             0 ,            0 ,            0 ,            0 ,           0 ,           5*t2^4 ,      4*t2^3 ,       3*t2^2 ,       2*t2^1 ,       1*t2^0 ,      0 ,          -5*t2^4 ,     -4*t2^3 ,      -3*t2^2 ,      -2*t2^1 ,      -1*t2^0 ,     0 ;          %t = 2T/3时的速度衔接
%      0             0 ,            0 ,            0 ,            0 ,           0 ,           20*t2^3 ,     12*t2^2 ,      6*t2^1 ,       2*t2^0 ,       0 ,           0 ,          -20*t2^3 ,    -12*t2^2 ,     -6*t2^1 ,      -2*t2^0 ,      0 ,           0 ;          %t = 2T/3时的加速度衔接
%      0 ,           0 ,            0 ,            0 ,            1 ,           0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0 ,          0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = 0时的速度
%      5*t1^4 ,      4*t1^3 ,       3*t1^2 ,       2*t1^1 ,       1*t1^0 ,      0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0 ,          0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = T/3时的速度
%      0 ,           0 ,            0 ,            0 ,            0 ,           0 ,           5*t2^4 ,      4*t2^3 ,       3*t2^2 ,       2*t2^1 ,       1*t2^0 ,      0            0 ,           0 ,            0 ,            0 ,            0 ,           0 ;          %t = 2T/3时的速度
%      0 ,           0 ,            0 ,            0 ,            0 ,           0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0 ,          5*t3^4 ,      4*t3^3 ,       3*t3^2 ,       2*t3^1 ,       1*t3^0 ,      0 ;          %t = T时的速度
%      0 ,           0 ,            0 ,            0 ,            0 ,           0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0,           20*t3^3 ,     12*t3^2 ,      6*t3^1 ,       2*t3^0 ,       0 ,           0 ;];        %t = T时的加速度
%  
% beq=[point_input(1); point_input(2); point_input(3); point_input(4);   
%      0;   0 ;  0 ;  0 ;  0 ;  0 ;  
%      vel_input(1); vel_input(2); vel_input(3); vel_input(4);  
%      0;];
% 
% %不等式约束
% A=[0 ,           0 ,            0 ,            -2 ,           0 ,           0 ,           0 ,           0 ,            0 ,            0 ,            0 ,           0,           0 ,           0 ,            0 ,            0 ,            0 ,           0;];           %t = 0时的加速度
% 
% b=[0;];
% 
% [x] = quadprog(H,f,A,b,Aeq,beq);
% 
% para_output = x;

end